app/controllers/notes_controller.rb

  def new
    if session[:state].nil? || session[:state].casecmp('Start') == 0
      @notes = Note.all
       render action: 'index', notice: 'No active pomodoro.' , note: @notes
    end

    @pomodoro = Pomodoro.last
    @pomodoro = Pomodoro.create if @pomodoro.nil? || @pomodoro.created_at<30.minutes.ago
---
SELECT "pomodoros".* FROM "pomodoros" ORDER BY "pomodoros"."id" DESC LIMIT 1
INSERT INTO "pomodoros" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 29 Oct 2013 01:47:24 UTC +00:00], ["updated_at", Tue, 29 Oct 2013 01:47:24 UTC +00:00]]

  def create
    @note = Note.new(note_params)

    @note.created_at = DateTime.now
---
INSERT INTO "notes" ("created_at", "description", "pomodoro_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 29 Oct 2013 02:40:11 UTC +00:00], ["description", "ffffffffffffffff"], ["pomodoro_id", 3], ["updated_at", Tue, 29 Oct 2013 02:40:11 UTC +00:00]]