app/controllers/pomodoros_controller.rb

  def getTree
    @pomos = Pomodoro.all
    data = [];

    @pomos.each {|item|
      @TreeData = ({:data => 'pomodoro ' + item.id.to_s, :attr => { :href => '/pomodoros/' + item.id.to_s, :rel => 'pomodoro' }})
      @TreeData[:children] = children = []
      item.notes.each {|item|
---
SELECT "pomodoros".* FROM "pomodoros"
SELECT "notes".* FROM "notes" WHERE "notes"."pomodoro_id" = ?  [["pomodoro_id", 1]]