app/controllers/pomodoros_controller.rb

SELECT "nodes".* FROM "nodes" WHERE "nodes"."pomodoro_id" = ?  [["pomodoro_id", 1]]
---
  def getTree

    @pomos = Pomodoro.all
    data = [];

    @pomos.each {|item|
      _endTime = item.end_time
      _endTime = (item.end_time.nil? ) ? 'Now' : item.end_time.to_formatted_s(:long)
      @TreeData = ({:data => item.created_at.to_formatted_s(:long) + ' - ' + _endTime, :attr => { :href => '/pomodoros/' + item.id.to_s, :rel => 'pomodoro' }})
      @TreeData[:children] = children = []
      item.nodes.each {|node|